[
  {
    "id": "barosa_app",
    "name": "Barosa",
    "platform": "mobile",
    "intro": "A collector's dream come true.",
    "techStack": ["React Native", "MongoDB", "TypeScript"],
    "status": "live",
    "jobType": "full time",
    "company": "Puzzle",
    "location": "Remote",
    "role": "Full Stack Developer",
    "time": "Nov. 2023 - present",
    "responsibilities": [
      "Develop the Vouch feature for the application.",
      "Devlop, update and maintain the Groups feature as well as generate the logic for Posting items for sale",
      "Refactor and implement best code practices for several modules in the application",
      "Aid in documenting new features and modules for the application",
      "Mainatain and update the application."
    ],
    "img": "/img/banners/mock-shop.png",
    "url": "",
    "companyLogo": "/img/companies/puzzle.jpeg",
    "fullDesc": "Barosa is my most recent project, it is like a social media platform for collectors, where they can share their collections, buy, sell, and trade items. The project is still in development and I am currently working on the Vouch, Groups, and Posts features. We're aiming for a soon release to the stores and also a web version of the app is planned for the future. Interesting fact: Barosa means trust."
  },
  {
    "id": "portfolio_v3",
    "name": "Dev Portfolio",
    "platform": "web",
    "intro": "Personal developer portfolio.",
    "techStack": ["Next JS", "TypeScript", "Tailwind CSS"],
    "status": "live",
    "jobType": "personal project",
    "company": "Independent",
    "location": "San Pedro Sula, Honduras",
    "role": "Full Stack Developer",
    "time": "Sept. 2023",
    "responsibilities": [
      "Design frontend to be used and develop reusable components.",
      "Develop and refactor site in order to show a creative and responsive design.",
      "Maintain and update portfolio."
    ],
    "img": "/img/banners/portfolio.png",
    "url": "/",
    "companyLogo": "/profile.jpg",
    "fullDesc": "This is the third version of my professional portfolio. I decided to go with Next.js 13 and Typescript with Tailwind CSS to practice and to 'play' with the newest version of Next.js. It has been and will continue to be a proyect with improvements. Hopefully this captures how organized, detailed, creative, and honest I am as a person and as a developer. PD: it is fully responsive and supports both light and dark themes."
  },
  {
    "id": "mock_shop",
    "name": "Mock Shop",
    "platform": "web",
    "intro": "E-commerce example using MERN stack.",
    "techStack": ["React", "MongoDB", "Node JS", "Express JS"],
    "status": "off",
    "jobType": "technical assessment",
    "company": "Puzzle",
    "location": "Remote",
    "role": "Full Stack Developer",
    "time": "Oct. 2022 - present",
    "responsibilities": [
      "Short exercise to evaluate candidates for a Full stack role using MERN.",
      "Develop and evaluate assessment for all candidates.",
      "Conduct technical interviews."
    ],
    "img": "/img/banners/mock-shop.png",
    "url": "",
    "companyLogo": "/img/companies/puzzle.jpeg",
    "fullDesc": "This project is an exercise I did as part of my technical interviewer services at Puzzle. I was told to create a simple exercise for candidates to a MERN Developer role that was open at the time. The porject is simple, a maintenance app for mock products, the application should list all products (coming from a fake API) and users should be able to add, edit, cancel, and pay their orders. The most complex part was calculating the total with a given tax and to be able to convert o various currencies."
  },
  {
    "id": "imitig8_app",
    "name": "iMitig8 Risk Global",
    "platform": "mobile",
    "intro": "A risk engineer's best friend.",
    "techStack": ["React Native", "MongoDB", "Swift", "Java"],
    "status": "live",
    "jobType": "full time",
    "company": "Puzzle",
    "location": "Remote",
    "role": "Full Stack Developer",
    "time": "Oct. 2022 - present",
    "responsibilities": [
      "Refactoring and fixing major security breaches on the mobile app",
      "Assist in the creation of new endpoints on the C# backend",
      "Improve and develop new features for the web portal",
      "Develop new modules on the mobile app",
      "Update and migrate modules on the mobile app to comply with new business standards"
    ],
    "img": "/img/banners/imitig8.jpeg",
    "url": "https://apps.apple.com/bo/app/imitig8-risk-global/id1532921468",
    "companyLogo": "/img/companies/puzzle.jpeg",
    "fullDesc": "This was inherited code and as usual, it came with a lot of problems inherited. Initally I was hired as a mobile developer but after the first weeks, I started working as a full stack developer creating new modules on the mobile app, the website, and refactring backend endpoints. This project was improved drastically and I also solved several security breaches that came along with the project."
  },
  {
    "id": "iron24_app",
    "name": "Iron24",
    "platform": "mobile",
    "intro": "Need a gym in the US?",
    "techStack": ["React Native", "SQL Server", "Azure"],
    "status": "live",
    "jobType": "full time",
    "company": "Believe Solutions",
    "location": "Remote",
    "role": "Full Stack & Mobile Developer",
    "time": "March 2022 - Oct. 2022",
    "responsibilities": [
      "Develop the React Native front-end for the entire application.",
      "Optimize existing APIs to enhance performance and streamline calls.",
      "Oversee the complete project life cycle, from inception to delivery.",
      "Conduct bug fixing and testing, including both end-to-end and unit testing.",
      "Integrate with external services such as Azure, Google Maps API, Geolocation services, OpenPath, and Stripe API for payment processing."
    ],
    "img": "/img/banners/iron24.jpeg",
    "url": "https://play.google.com/store/apps/details?id=com.franchiczar.iron",
    "companyLogo": "/img/companies/believe.jpeg",
    "fullDesc": "One of the four franchises owned by our client, Iron24 is a chain of gyms in the US. We developed a white ladeling app and we started with Iron24. My main contributions were the Google Maps API integration, the Stripe API integration as well as the creation and maintenance of several app modules including: Facility Selection, Checkout screen, Payment Method screen, Profile Screen, to name a few."
  },
  {
    "id": "saver_app",
    "name": "The Saver",
    "platform": "mobile",
    "intro": "Mobile app for college students in Ohio.",
    "techStack": ["React Native", "GraphQL", "AWS"],
    "status": "live",
    "jobType": "full time",
    "company": "Code Éxitos",
    "location": "San Pedro Sula, Honduras",
    "role": "Full Stack Developer",
    "time": "March 2021 - March 2022",
    "responsibilities": [
      "Develop the entire React front-end for the application.",
      "Modify the existing backend to accommodate new features.",
      "Oversee the complete project life cycle, from inception to delivery.",
      "Conduct bug fixing and testing, including both end-to-end and unit testing."
    ],
    "img": "/img/banners/saver-app.png",
    "url": "https://play.google.com/store/apps/details?id=com.saverapp",
    "companyLogo": "/img/companies/cex.jpeg",
    "fullDesc": "An already started project, I came to help with the maintenance and also creating and improving features, UI, and efficiency. "
  },
  {
    "id": "saver_site",
    "name": "The Saver",
    "platform": "web",
    "intro": "Don't like printed magazines? Visit this site...",
    "techStack": ["React", "GraphQL", "AWS"],
    "status": "live",
    "jobType": "full time",
    "company": "Code Éxitos",
    "location": "San Pedro Sula, Honduras",
    "role": "Full Stack Developer",
    "time": "March 2021 - March 2022",
    "responsibilities": [
      "Develop the entire React front-end for the application.",
      "Modify the existing backend to accommodate new features.",
      "Oversee the complete project life cycle, from inception to delivery.",
      "Conduct bug fixing and testing, including both end-to-end and unit testing."
    ],
    "img": "/img/banners/saver-web.png",
    "url": "https://www.thesaver.com/",
    "companyLogo": "/img/companies/cex.jpeg",
    "fullDesc": "Leading this project was quiet a challenge - there are some things that I cannot mention here - but it as a fun challenge. I got to lead the project and mentor a junior developer who became a great team member. This website is mainly static screens fetching data from a CMS. I was in charge of creating the virtual magazine screen, the integration with Google Maps and Cognito to manage sessions."
  },
  {
    "id": "clink_app",
    "name": "Clink",
    "platform": "web",
    "intro": "New era of meeting polls has just arrived.",
    "techStack": ["React", "GraphQL", "AWS"],
    "status": "live",
    "jobType": "full time",
    "company": "Code Éxitos",
    "location": "San Pedro Sula, Honduras",
    "role": "Full Stack Developer",
    "time": "March 2021 - March 2022",
    "responsibilities": [
      "Design and develop the entire user interface for the application.",
      "Create and implement a GraphQL database to support the application’s data needs.",
      "Integrate Cognito and Syncfusion (spreadsheets) into the application’s architecture.",
      "Conduct testing, deployment, documentation, and ongoing maintenance to ensure the application’s continued success."
    ],
    "img": "/img/banners/clink.png",
    "url": "https://staging.d15tnny0cb32sc.amplifyapp.com/",
    "companyLogo": "/img/companies/cex.jpeg",
    "fullDesc": "My first project at Code Exitos, this was a very interesting project with - so far - the coolest clients I've worked with. The main purpose of this project was helpig with polls, basically all members would log in into the system and they will receive a custom diagram/template. Users would drg and drop their 'object' to the section they wanted which would determine their vote. After all votes were submitted, we would generate a summary of the voting process and present results in spreadsheets that could be downoaded. Templates/diagrams could be customized as needed, no limits."
  },
  {
    "id": "doctor7_site",
    "name": "Doctor 7 Clinic",
    "platform": "web",
    "intro": "Modern doctors better check this site...",
    "techStack": ["React", "MongoDB"],
    "status": "live",
    "jobType": "full time",
    "company": "Experenta",
    "location": "San Pedro Sula, Honduras",
    "role": "Full Stack Developer",
    "time": "Dec. 2019 - March 2021",
    "responsibilities": [
      "Develop the entire front-end for the website and mobile application, including user interface design and implementation.",
      "Design and implement both the user interface and backend services for the application and website.",
      "Build and maintain a robust backend to support the application’s functionality.",
      "Conduct thorough testing and deploy the application to hosting services, the Google Play Store, and the Apple App Store.",
      "Provide ongoing maintenance and support.",
      "Designing and developing a version 2.0 of the mobile application."
    ],
    "img": "/img/banners/doctor7-web.png",
    "url": "https://www.doctor7.clinic/login",
    "companyLogo": "/img/companies/experenta.jpeg",
    "fullDesc": "This web app would include and extend the features that the mobile application had. The idea is providing doctors with the same (and some extras) experience as the mobile app - which was our first project. Doctor7 is a 100% Honduran Startup born in the context of the COVID-19 pandemic, founded by Dr. José Salgado, Eng. Jorge Lanza and Eduardo Salgado to provide the Honduran population with medical care from the comfort of their home."
  },
  {
    "id": "doctor7_app",
    "name": "Doctor 7",
    "platform": "mobile",
    "intro": "The new era of medical appointments.",
    "techStack": ["React Native", "MongoDB", "Google Cloud"],
    "status": "live",
    "jobType": "full time",
    "company": "Experenta",
    "location": "San Pedro Sula, Honduras",
    "role": "Full Stack Developer",
    "time": "Dec. 2019 - March 2021",
    "responsibilities": [
      "Develop the entire front-end for the website and mobile application, including user interface design and implementation.",
      "Design and implement both the user interface and backend services for the application and website.",
      "Build and maintain a robust backend to support the application’s functionality.",
      "Conduct thorough testing and deploy the application to hosting services, the Google Play Store, and the Apple App Store.",
      "Provide ongoing maintenance and support.",
      "Designing and developing a version 2.0 of the mobile application."
    ],
    "img": "/img/banners/doctor7-app.png",
    "url": "https://play.google.com/store/apps/details?id=com.doctor7&hl=en_US&gl=US",
    "companyLogo": "/img/companies/experenta.jpeg",
    "fullDesc": "The project you'll hear me talking about frequently... Doctor7 is a 100% Honduran Startup born in the context of the COVID-19 pandemic, founded by Dr. José Salgado, Eng. Jorge Lanza and Eduardo Salgado to provide the Honduran population with medical care from the comfort of their home. We developed an application that would facilitate creating and attending medical appointments during the pandemic, from creating in person appointments to videocalls with patients, this application is still live and growing, expanding to more countries in Central America."
  },
  {
    "id": "dnaCenter_site",
    "name": "Cisco DNA Center",
    "platform": "web",
    "intro": "Salesforce for datacenters and networking.",
    "techStack": ["React", "Python3", "MongoDB", "Heroku"],
    "status": "off",
    "jobType": "full time",
    "company": "Experenta",
    "location": "San Pedro Sula, Honduras",
    "role": "Full Stack Developer",
    "time": "Dec. 2019 - March 2021",
    "responsibilities": [
      "Develop a React-based front-end to support the application’s user interface.",
      "Design and implement a Python-based backend to support the application’s functionality.",
      "Configure and customize the Salesforce Org to meet the application’s requirements.",
      "Integrate the various components of the project through Heroku, including the creation of necessary webhooks to facilitate communication between systems."
    ],
    "img": "/img/banners/cisco.png",
    "url": "",
    "companyLogo": "/img/companies/experenta.jpeg",
    "fullDesc": "First professional experience writting Python code to manage a Cisco networking system: I created webhooks on Cisco DNA Center and Meraki systems, connect those webhooks to a Node.js backend so I could parse data and send to a Salesforce Org and a React.js frontend for a local drinks company in Honduras and El Salvador. The system was used to create network alerts if the contact center, offices, or even drivers experimented or had issues with the network."
  }
]
